# Ultralytics YOLO, AGPL-3.0 license
# Ablation C: DWR + EIEStem, with standard nearest-neighbor upsampling and P3-P5 detection.

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, EIEStem, [64, 128]] # 0-P2/4
  - [-1, 2, C3k2_DWR, [256, False, 0.25]] # 1
  - [-1, 1, Conv, [256, 3, 2]] # 2-P3/8
  - [-1, 2, C3k2_DWR, [512, False, 0.25]] # 3
  - [-1, 1, Conv, [512, 3, 2]] # 4-P4/16
  - [-1, 2, C3k2_DWR, [512, True]] # 5
  - [-1, 1, Conv, [1024, 3, 2]] # 6-P5/32
  - [-1, 2, C3k2_DWR, [1024, True]] # 7
  - [-1, 1, SPPF, [1024, 5]] # 8
  - [-1, 2, C2PSA, [1024]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 15-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 18-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 21-P5/32

  - [[15, 18, 21], 1, Detect, [nc]]
