# Ultralytics YOLO 🚀, AGPL-3.0 license
# 改进方案: EIEStem + C3k2_DWR + P2层检测（4层检测头）
# 核心改进: 在Head部分引入P2层（4倍下采样，160x160高分辨率特征图）
# 目标: 解决细长小目标（扳手、钳子）的严重漏检问题
# EIEStem: 边缘信息增强Stem，Sobel边缘+MaxPool双分支，总下采样4x
# 适用场景: X光安检违禁品检测，特别针对细长金属工具的小目标检测

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, EIEStem, [64, 128]] # 0-P2/4 (Sobel边缘增强，总下采样4x，输出128ch)
  - [-1, 2, C3k2_DWR, [256, False, 0.25]] # 1
  - [-1, 1, Conv, [256, 3, 2]] # 2-P3/8
  - [-1, 2, C3k2_DWR, [512, False, 0.25]] # 3
  - [-1, 1, Conv, [512, 3, 2]] # 4-P4/16
  - [-1, 2, C3k2_DWR, [512, True]] # 5
  - [-1, 1, Conv, [1024, 3, 2]] # 6-P5/32
  - [-1, 2, C3k2_DWR, [1024, True]] # 7
  - [-1, 1, SPPF, [1024, 5]] # 8
  - [-1, 2, C2PSA, [1024]] # 9

# Head (P2, P3, P4, P5 四层检测)
head:
  # P5 -> P4 上采样路径
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 12

  # P4 -> P3 上采样路径
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 15

  # P3 -> P2 上采样路径 (新增)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2 (layer 1)
  - [-1, 2, C3k2, [128, False]] # 18 (P2/4-tiny) ⭐新增P2检测层

  # P2 -> P3 下采样路径
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 21 (P3/8-small)

  # P3 -> P4 下采样路径
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 24 (P4/16-medium)

  # P4 -> P5 下采样路径
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]] # Detect(P2, P3, P4, P5) ⭐4层检测头
